# Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
line = 1
while line <= 5:
    # не смог сделать номерецыю строк с закрывающими круглыми скобками без пробелов
    print (line, ')' , '00000')
    line += 1