# Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
# А зачем готовый код дали в самом задании? Даже не интересно...
sum = 0
for i in range(1,101):
    sum+=i
print(sum)