# Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
sum = 1
for i in range(1,10):
    sum*=i
print(sum)